package com.youqu.network.bean.res;

import java.util.List;

/**
 * Created by yaoh on 2018/1/29.
 */

public class HistoryTodayData {


    /**
     * msg : success
     * result : [{"date":"13680123","day":23,"event":"　　朱元璋（1328\u2014\u20141398），名重八，又名兴宗，字国瑞，濠州钟离（今安徽凤阳东）人。出身贫农家庭，小时候曾在直觉寺作过和尚，1352年（元至正十二年）参加嚎州郭子兴部红巾军。\n　　1355年（元至正十五年）韩林儿在毫称帝时封他为左副元帅。朱元璋军纪严明，又知人善任，文全冯国胜、李善长等都为他出谋划策，勇猛善战的常遇春、胡大海等都来投奔他。\n　　1356年（元至正十六年）攻下集庆（今江苏南京），废除了元朝的一些苛政，命请将屯田。后来又接受了朱开的\u201c高筑墙，广积粮，缓称王\u201d的建议，壮大了自己的势力。1367年（元至正二十七年），朱元璋决意北伐，提出\u201c驱逐胡虏，恢复中华\u201d，\u201c立纲陈纪，救济斯民\u201d的口与。\n　　1368年正月，北伐军进占大都，结束了元朝的统治。\n　　1368年1月23日（明洪武元年正月初四日）建立了明朝，改元洪武，定都南京。\n","id":"569881af590146d407331889","month":1,"title":"朱元璋建立明朝"},{"date":"17830123","day":23,"event":"　　司汤达是法国19世纪杰出的批判现实主义家，他的著名小说《红与黑》，以其进步的思想倾向，以及对当时社会阶级关系的深刻描写，和对典型性格的出色的刻画，在全世界享有盛名。1783年1月23日，司汤达生于法国格勒诺布勒城的一个资产阶级家庭。他的本名叫亨利·贝尔。他早年丧母，父亲是一个有钱的律师，信仰宗教，思想保守，司汤达在家庭中受到束缚和压抑，从小就憎恶他父亲。1799年，司汤达以优异的成绩毕业于当地的中心学校，来到巴黎，在军部谋到一个职务。从此，他跟随拿破仑的大军，参加了两种力量，两种制度在整个欧洲的大搏斗。直到1814年，拿破仑垮台，波旁王朝复辟，司汤达被\u201c扫地出门\u201d，不得已离开巴黎，侨居意大利的米兰。他在米兰期间，读书、旅行、研究意大利的音乐和美术，与从事意大利民族解放战争的烧炭党人有所交往。1815年，他的第一部作品音乐家传记问世，从此开始他的写作生涯。1821年，意大利的烧炭党人的起义遭到镇压，司汤达被当局视为危险分子，被迫离开米兰回巴黎。在巴黎，他一面写作，一面认真观察复辟时期的社会生活，对自己时代的矛盾有了深刻的认识，终于写出了深刻反映七月革命前的法国社会现实的长篇小说《红与黑》，使他成为19世纪杰出的批判现实主义作家。\n","id":"569881af590146d407331888","month":1,"title":"《红与黑》的作者司汤达诞辰"},{"date":"18910123","day":23,"event":"　　\u201c无产阶级的解放是一个艰苦的事业，只有坚贞不屈的人才能胜任，只有那些在人们普遍感到悲观失望的时候能够保持不屈不挠的精神的人，只有那些意志锻炼得坚如刀剑的人，才配称为工人阶级的战士，才配称为革命者。\u201d这是意大利共产党创始人安东尼奥·葛兰西的生前名言。他自己的一生，正是身体力行地实践了这个名言。1891年1月23日，葛兰西生于意大利撒丁岛一个小职员家庭，家境贫寒，靠勤工和奖学金读完都灵大学。在大学期间，1913年他加入意大利社会党。大学毕业后，担任都灵社会周报《人民呼声报》主编。当时，第一次世界大战爆发。葛兰西响应列宁\u201c变帝国主义战争为国内战争\u201d的口号，发动都灵工人举行反战武装起义，在工人中赢得威望，被选为社会党都灵支部书记。大战结束后，意大利革命运动空前高涨，工人和农民决心要走\u201c俄国人道路\u201d。1921年1月21日意大利共产党成立。葛兰西是党的创始人之一。1922年5月，葛兰西作为意共代表当选为共产国际执委会书记处书记。1922年10月，以墨索里尼为首的法西斯分子在意大利夺取了国家政权。葛兰西受共产国际委派回国领导意共开展反法西斯斗争。1926年11月不幸被捕。他在法庭上对法西斯分子义正词严地说：\u201c你们把意大利引向毁灭，我们共产党人一定要挽救它。\u201d在监狱中，虽遭百般折磨，他仍以坚强的意志研究革命理论，写下32本《狱中札记》，这是意大利现代思想史上的重要著作。1937年4月27日，葛兰西这位坚强的战士在法西斯狱中与世长辞。\n","id":"569881af590146d407331887","month":1,"title":"意大利共产党创始人葛兰西诞辰"},{"date":"19230123","day":23,"event":"　　1923年1月23日晚，有收音机的上海人第一次听到一种新的声音，这是由在华经营电讯业务的美国无线电商人奥斯邦开办的中国无线电公司与英文《大陆报》联合创办的一家广播电台。这是在中国境内的第一座广播电台，呼号XRO，发射功率50瓦，每晚播音1小时，内容有国内外和上海新闻，但主要是娱乐节目，星期日设有《布道》、《祈祷》等宗教性节目。为了推销收音机，该台还举办无线电基本常识讲座。\n　　因该台的设立未经中国政府有关当局批准，触犯了北京政府的法令，北京政府外交部派人员多次交涉，该电台在不久即停止了播音。\n","id":"569881af590146d407331886","month":1,"title":"中国第一座民办广播电台开始播音"},{"date":"19370123","day":23,"event":"　　1927年布哈林在联共（布）第十五次代表大会上被选为中央政治局委员布哈林，苏联共产党的早期领导人之一。经济学家。\n　　1906参加俄国社会民主工党。俄国二月革命后被选为党中央委员。十月革命后，任《真理报》主编、中央政治局委员、第三国际执委会委员和主席团委员等职。1928年因对国家工业化和农业集体化问题持不同看法，受批判。次年，被解除联共（布）中央政治局委员和《真理报》主编职务。1931年任最高国民经济委员会委员。1934年任《消息报》主编。1937年被开除出党。后以\u201c判国罪\u201d被处决。1988年恢复名誉。著有《世界经济和帝国主义》、《过渡时期的经济》、《共产主义ABC》等。\n","id":"569881af590146d407331885","month":1,"title":"苏联布哈林等17名共产党领导人被判死刑"},{"date":"19420123","day":23,"event":"　　1942年1月23日女作家萧红逝世，年仅31岁。1月25日，葬于香港浅水湾。1941年圣诞节的前两天，萧红病情急剧恶化，被送入羊和医院。主治医生误诊她为喉瘤，喉管开刀后，萧红不能发声，痛苦万状。\n　　1月18日，萧红被转送至玛丽医院，由于日寇占领香港，一切医疗用具奇缺，萧红难以得到正常的治疗。临终前，她在纸上写下\u201c我将与蓝天碧水永处。......\u201d等字。\n　　萧红，原名张乃莹，1911年生于黑龙江呼兰县。1930年，她为抗婚离家出走。1933年她在鲁迅的帮助下开始创作，1935年她出版了长篇小说《生死撤，该书描写了北方农村在\u201c九·一八\u201d前后的真实图景，此后萧红出版了小说集《牛车上》。1937年10月，萧红和萧军随上海文化人士的撤退队伍，离开了上海。在武汉，萧红和胡风、萧军、端木蕻良等人一起创办了刊物《七月》。\n　　1938年1月，应李公朴的邀请，萧红与聂绀弩、萧军、艾青等人一起来到临汾，任教于山西民族革命大学。1938年2月，日军即将进攻临汾，萧红便随丁玲领导的\u201c西北战地服务团\u201d到西安。在西安，她同一起生活了6年的萧军正式分手。4月，萧红与端木蕻良回武汉同居。八九月间，他们来到重庆，因为在码头跌跤，萧红流产。在极恶劣的环境下，萧红仍拖着病体写作。写完《回忆鲁迅先生》后，又开始创作长篇小说《呼兰河传》。\n　　1940年春，萧红和端木蕻良来到香港，应复旦大学教务处孙寒冰约请，编辑《大时代》丛书。这时，萧红的身体越来越差，咳嗽、头痛、失眠。.....在病痛的折磨中，萧红勤奋地写作。她写完了《呼兰河传》，同时又创作了另一部长篇小说《马伯乐》，并应女作家杨刚之约，创作了纪念鲁迅先生的哑剧《民族魂》。\n","id":"569881af590146d407331884","month":1,"title":"女作家萧红病逝"},{"date":"19570123","day":23,"event":"　　1957年1月23日，世界上第一台醉酒呼吸分析仪首次在瑞典投入使用，警察在街头用醉酒呼吸分析仪检查。\n","id":"569881af590146d407331880","month":1,"title":"世界上第一台醉酒呼吸分析仪首次在瑞典投入使用"},{"date":"19670123","day":23,"event":"　　1967年1月23日中共中央、国务院，中央军委，中央文革小组作出《关于人民解放军坚决支持革命左派群众的决定》。不久，毛泽东又赋予军队支农、支工、军管、军训等项任务。8月19日，中央军委作出《关于集中力量执行支左、支农、支工、军管、军训任务的决定》，派人民解放军实行\u201c三支两军\u201d。1972年8月21日，中共中央、中央军委决定\u201c三支两军\u201d人员撤回部队。\n","id":"569881af590146d407331883","month":1,"title":"中共中央决定人民解放军\u201c支左\u201d"},{"date":"19760123","day":23,"event":"　　1976年1月23日，77岁的保罗·罗伯逊在费城去世，美国的一位最有影响的黑人表演家、政治要人消失了。罗伯逊长得象全美橄榄球星一样魁梧、健壮。他曾就读于拉特格斯大学，是位领导人物，也是当时最优秀的男中音歌手和给人以深刻印象的演员。他扮演的奥赛罗最令人难忘。而他在影片《汤姆叔叔的小屋》中演唱的《老人河》给中国观众留下了深刻的印象。做为社会主义的倡导者，罗伯逊在西班牙内战期间曾去那里为国际纵队队员演唱。由于他坚持社会主义思想，对苏联进行公开赞颂，于1952年接受了斯大林和平奖金。罗伯逊在冷战时期和麦卡锡审讯期间在国内受到排斥。\n","id":"569881af590146d407331882","month":1,"title":"美国黑人歌唱家保罗·罗伯逊去世"},{"date":"19770123","day":23,"event":"　　1977年1月23日，《人民日报》报道，被\u201c四人帮\u201d打入冷宫10年之久的优秀歌剧《洪湖赤卫队》在武汉重新公演。\n　　《洪湖赤卫队》是湖北省歌舞剧团创作演出的。1966年\u201c文化大革命\u201d中，为配合打倒贺龙同志，这部优秀歌剧被打入冷宫。粉碎\u201c四人帮\u201d后，湖北省歌剧团将《洪湖赤卫队》重新搬上舞台。许多人把此剧公演看作是贺龙即将平反的信号。\n","id":"569881af590146d407331881","month":1,"title":"歌剧《洪湖赤卫队》重新公演"},{"date":"19840123","day":23,"event":"　　1984年1月23日，阿根廷和智利两国外长在梵帝冈签署了《和平友好联合声明》，重申两国政府和平解决比格尔海峡三个岛屿领土争端的决心。比格尔海峡是南美洲南端邻近合恩角的一条东西走向的自然水道，全长约120公里。阿、智两国长期以来争议的焦点是该海峡东南部的皮克顿、努埃瓦、伦诺克斯三个岛屿领土的归属问题。这三个岛屿的总面积只有345平方公里。阿、智两国长期为此发生争执的主要原因是，比格尔海峡地理位置十分重要和具有丰富的海底资源。一、比格尔海峡扼太平洋和大西洋航道的咽喉，有争议的三岛则位于水道在大西洋的出海口，隔德雷克海峡与南极相望。在巴拿马运河运输越来越不适应远洋货轮吨位迅速增长的情况下，绕过合恩角的南美两洋航运日显重要，水道区的战略地位也随之突出。二、海峡及周围海域蕴藏着丰富的石油和磷虾等海产资源。三、争议地区是两国开发南极的重要前沿阵地。阿、智两国都非常重视对南极海底资源的开发。根据200海里海洋权的原则，两国在划分边界、确定岛屿归属时将包括岛屿周围大片海域的归属。由于以上原因，控制比格尔海峡不仅对决定两国在南极洲的领土要求事关重大，而且可以进而提出东至大西洋西南200海里的领土要求。而这无论对阿根廷还是智利的经济发展都将起重要作用。比格尔海峡的领土争端问题是历史上遗留下来的。1855年两国签订《和平友好贸易通航条约》时，只笼统承认双方脱离西班牙统治时各自的边界。1881年签订边界条约和1893年签订附加议定书时，也未提及领土主权问题。因此两国在该地区的边界纠纷不断发生。1902年，阿、智两国签订《仲裁总条约》，委托英国仲裁争端，但仍未能解决问题。1972年，两国政府同意将1881年阿、智边界协定提交国际仲裁法庭进行裁决。1977年5月2日，英国宣布：由5名国际法庭成员组成的仲裁小组决定，将比格尔海峡东南的三个岛屿判归智利。智利表示接受裁决，但阿根廷拒绝接受。此后，两国矛盾加剧，各自陈兵边界，几乎爆发战争。但是这种局势对两国都很不利，于是，1984年1月下旬，在罗马教皇的调解下，阿智两国外长在梵帝冈举行会谈，签署了《和平友好联合声明》。声明说，阿智两国人民\u201c时刻萦绕在怀的\u201d是友谊与和平。两国下决心要为1978年使彼此处于战争边缘的比格尔海峡领土争端找到最终解决的办法。\n","id":"569881af590146d40733187f","month":1,"title":"阿根廷、智利签署《和平友好联合声明》"},{"date":"19890123","day":23,"event":"　　1989年1月23日，亚洲卫星有限公司与中国长城工业公司在北京签署\u201c亚洲卫星一号\u201d通信卫星的发射服务合同。根据这个合同，由中国参与投资及经营的\u201c亚洲卫星一号\u201d，将于1990年2月至4月由中国长城工业公司在西昌卫星发射中心用\u201c长征三号\u201d火箭发射升空，进入地球同步转移轨道，最终定点于东南亚上空。\n　　亚洲卫星有限公司于1988年6月与长城工业公司签署了卫星发射协议，并已同部分国外用户签署了租用卫星转发器的意向书。\n　　\u201c亚洲一号\u201d是亚洲地区首颗区域性通信卫星，通信覆盖范围包括中国在内的亚洲大部分地区，并提供话音、数据、图象和其它信息的传递服务。这颗由美国休斯公司制造的卫星具有24个C频段转发器，寿命为10年，是国际上最成熟的通信卫星系列之一，其地面信号强度比我国现在租用的国际卫星大几倍，可以大大降低地面接收设施的成本。\n","id":"569881af590146d40733187e","month":1,"title":"亚洲卫星发射合同在京签署"},{"date":"19960123","day":23,"event":"　　1996年1月23日，中央军委在北京举行隆重的晋升上将军官军衔仪式，周子玉、于振武、丁文昌、隋永举4人晋升为上将。江泽民参加了授衔仪式。附录:我国军衔制是怎么产生的？已经授予了多少上将军衔？新中国成立后，为加强人民军队的正规化、现代化建设，实行军衔制问题很快被摆到议事日程上来。1950年9月4日，人民解放军总干部管理部成立时，设置了军衔奖励处，开始研究军衔制问题。1952年11月26日，总干部管理部向毛泽东主席并军委的报告中，对实行军衔制准备工作等问题拟订了初步计划。1955年2月8日，毛泽东颁布由第一届全国人大常委会第六次会议通过的《中国人民解放军军官服役条例》，其中对军官军衔做了规定，分元帅2级、将官4级、校官4级、尉官4级，共14级。1955年8月11日，国防部部长彭德怀、总政治部主任罗荣桓下达了关于军士和兵评定军衔的指示，规定了士兵军衔制的内容，士兵军衔分为军士3级，上等兵、列兵，共二等5级。1955年9月23日，第一届全国人大常委会第22次会议根据《军官服役条例》，审议了国务院总理周恩来提出的建议，决定授予对创建和领导人民武装力量、领导战役军团作战立有卓越功勋的高级将领以元帅军衔。同年9月27日，在北京举行授予元帅军衔及勋章典礼，毛泽东主席授予朱德等10人以元帅军衔；同日，国务院举行授予将官军衔和勋章典礼，周恩来总理将将官军衔的命令状分别授予粟裕等将官；28日，国防部举行授衔典礼，彭德怀部长授予在北京的部分校级军官军衔。此后，各大军区也先后举行了授衔仪式。第一次全军授予少尉以上军衔的军官53.1万余名，其中元帅10名、大将10名、上将55名、中将175名、少将800名，共计1040名。之后，又选升上将2名、中将2名、少将560名。1963年对《军官服役条例》作了修正，将第一次授予尉官军衔和少校军官军衔晋级交由各军区、军兵种、学院、公安部队、各总部首长代国防部部长审批、奉国防部部长命令公布并上报备案。1965年5月22日，第三届全国人大常委会第9次会议讨论决定，自当年6月1日起取消军衔制。至此，全军共授予将官以上军衔1614名。1980年3月，邓小平在军委扩大会议上提出，军队究竟搞不搞军衔制，也是组织路线问题。1982年12月4日，第五届全国人大第五次会议通过的《中华人民共和国宪法》规定，人民解放军将恢复军衔制度；1983年6月19日，中央军委发出《关于成立恢复军衔制领导小组的通知》，决定成立中央军委恢复军衔制领导小组，由余秋里、杨得志、萧克、王平、朱云谦、刘华清、张震等17人组成领导小组。其间，军委决定\"裁军百万\"，恢复军衔制工作推迟。1988年4月，根据军委和总部的人事变化情况，重新成立了实行军衔制度领导小组及其办公室，由杨白冰、迟浩田、赵南起、郭林祥、李耀文、朱光、丁衡高、刘凯、邢智勇、李继耐等10人组成。1988年7月1日，第七届全国人大常委会第2次会议通过中央军委提出的《中国人民解放军军官军衔条例》。《条例》对现役军官军衔等级的设置，现役军衔职务等级编制军衔，现役军官军衔的首次授予，现役军官军衔的晋级，现役军官军衔的降级、取消和剥夺，现役军官军衔的标志和佩带等都作了明确规定。现役军官军衔分为将官4级、校官4级、尉官3级，共3等11级。与此同时，会议还作出了《关于确认1955年至1965年期间授予的军官军衔的决定》。1988年9月14日，中央军委在北京举行授予上将军官军衔仪式，洪学智等17人被授予上将军衔。同年10月1日，人民解放军正式实施新的军衔制度，共授予尉官军衔40.5万人、校官军衔18万人，将军官衔1452人。1993年6月7日，中央军委在北京举行晋升上将军官军衔仪式，张万年等6人晋升为上将；1994年6月8日，徐惠滋等19人晋升为上将；1996年1月23日，周子玉等4人晋升为上将；1998年3月27日，曹刚川等9人晋升为上将。军衔的类别划分，在1955年颁布的文件中，全部衔称在类别上划分为八类18种：第一二类为指挥军官和政治军官军衔，包括12种；第三类为技术军衔；第四类为军需军衔；第五类为军医军衔；第六类为兽医军衔；第七类为军法军衔；第八类为行政军衔。各种军衔，除了按照条例规定在其称号前冠以相应名称外，还用缀在领章上的符号来标志。1988年实行的新军衔制，在军衔类别的区分上，作了较大精简，只保留四种：陆军军衔、海军军衔、空军军衔和专业技术军衔。陆军在衔称前不冠军种字样，以\u201c八一\u201d红五星衬托宝剑形光芒线的陆军符号作为领花加以标志；海军军衔，在衔称前冠以\u201c海军\u201d二字，以\u201c八一\u201d红五星衬托铁锚的海军符号作为领花加以标志；空军军衔，在衔称前冠以\u201c空军\u201d二字，以\u201c八一\u201d红五星衬托飞翔的空军符号作为领花加以标志；专业技术军衔，在衔称前冠以\u201c专业技术\u201d四字，以\u201c八一\u201d红五星衬托原子符号作为领花加以标志。\n　　附：中国人民解放军元帅、大将、上将一览表\n　　中华人民共和国元帅：朱德　彭德怀　林彪　刘伯承　贺龙　陈毅　罗荣桓　徐向前　聂荣臻　叶剑英（均为1955年9月23日授予）\n　　中国人民解放军大将：粟裕　徐海东　黄克诚　陈赓　谭政　萧劲光　张云逸　罗瑞卿　王树声　许光达（均为1955年9月27日授予）\n　　中国人民解放军上将：王平　王震　王宏坤　王新亭　韦国清　乌兰夫　邓华　甘泗淇　叶飞　吕正操　朱良才　刘震　刘亚楼　许世友　杨勇　杨成武　杨至成　杨得志　苏振华　李达　李涛　李天佑　李克农　李志民　宋任穷　宋时轮　张宗逊　张爱萍　陈士榘　陈再道　陈伯钧　陈奇涵　陈明仁　陈锡联　周桓　周士第　周纯全　赵尔陆　洪学智　钟期光　贺炳炎　郭天民　唐亮　陶峙岳　萧华　萧克　黄永胜　阎红彦　韩先楚　彭绍辉　董其武　傅钟　傅秋涛　谢富治　赖传珠（均为1955年9月27日授予）王建安（1956年1月25日授予）李聚奎（1958年授予）洪学智　刘华清　秦基伟　迟浩田　杨白冰　赵南起　徐信　郭林祥　尤太忠　王诚汉　张震　李德生　刘振华　向守志　万海峰　李耀文　王海（1988年9月14日根据中央军委主席邓小平签署的命令授予）张万年　于永波　傅全有　朱敦法　张连忠　曹双明（1993年6月7日，中央军委授予）徐惠滋　李景　杨德中　王瑞林　周克玉　丁衡高　戴学江　李文卿　王克　李来柱　谷善庆　刘精松　曹芃生　张太恒　宋清　渭固辉　李希林　史玉孝　李九龙（1994年6月8日，中央军委授予）周子玉　于振武　丁文昌　隋永举（1996年1月23日，中央军委授予）曹刚川　张工　邢世忠　王茂润　李新良　方祖岐　陶伯钧　张志坚（1998年3月27日，中央军委授予）郭伯雄　徐才厚（1998年9月29日,中央军委授予）\n","id":"569881af590146d40733187d","month":1,"title":"江泽民给上将军衔获得者授衔"},{"date":"19970123","day":23,"event":"　　1997年1月23日，韩国第二大钢铁企业韩宝钢铁公司宣告破产。调查证实，此案涉及大规模权钱交易行为。韩国政界、金融界、企业界有数十名要人卷入其中。\n　　在被捕判刑者中甚至包括总统金泳三的次子金贤哲。\n","id":"569881af590146d40733187a","month":1,"title":"韩国第二大钢铁企业韩宝钢铁公司破产"},{"date":"7540123","day":23,"event":"　　鉴真（688\u2014\u2014763），本姓淳于，扬州江阴（今江苏扬州）人。\n　　14岁在扬州大云寺削发为僧，22岁受戒。早年云游长安、洛阳等地，26岁起，住持扬州大明寺，专说戒律。此后曾研究建筑、雕塑、医药等成为一名知识渊博的高僧。\n　　743年始，应日本在唐朝学成回国的高僧荣睿、普照和日本政府的邀请，5次东渡都遭受挫折，未成。其间又因辛劳过度，感受暑热，双目失明。\n　　公元753年鉴真携带大量佛经佛像和书籍，作第6次东渡，经过千难万险，于754年1月23日（唐天宝十二载十二月二十六日）抵达日本九州。\n　　不久在奈良东大寺建筑成坛，传授戒法，为日本佛教徒登坛受戒的开始。日本朝廷封他为\u201c传灯大法师\u201d。鉴真东渡，为中日两国的友谊做出了杰出的贡献。\n","id":"569881af590146d40733188a","month":1,"title":"鉴真东渡到达日本"}]
     * retCode : 200
     */

    private String msg;
    private String retCode;
    private List<ResultBean> result;

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public String getRetCode() {
        return retCode;
    }

    public void setRetCode(String retCode) {
        this.retCode = retCode;
    }

    public List<ResultBean> getResult() {
        return result;
    }

    public void setResult(List<ResultBean> result) {
        this.result = result;
    }

    public static class ResultBean {
        /**
         * date : 13680123
         * day : 23
         * event : 　　朱元璋（1328——1398），名重八，又名兴宗，字国瑞，濠州钟离（今安徽凤阳东）人。出身贫农家庭，小时候曾在直觉寺作过和尚，1352年（元至正十二年）参加嚎州郭子兴部红巾军。
         　　1355年（元至正十五年）韩林儿在毫称帝时封他为左副元帅。朱元璋军纪严明，又知人善任，文全冯国胜、李善长等都为他出谋划策，勇猛善战的常遇春、胡大海等都来投奔他。
         　　1356年（元至正十六年）攻下集庆（今江苏南京），废除了元朝的一些苛政，命请将屯田。后来又接受了朱开的“高筑墙，广积粮，缓称王”的建议，壮大了自己的势力。1367年（元至正二十七年），朱元璋决意北伐，提出“驱逐胡虏，恢复中华”，“立纲陈纪，救济斯民”的口与。
         　　1368年正月，北伐军进占大都，结束了元朝的统治。
         　　1368年1月23日（明洪武元年正月初四日）建立了明朝，改元洪武，定都南京。

         * id : 569881af590146d407331889
         * month : 1
         * title : 朱元璋建立明朝
         */

        private String date;
        private int day;
        private String event;
        private String id;
        private int month;
        private String title;

        public String getDate() {
            return date;
        }

        public void setDate(String date) {
            this.date = date;
        }

        public int getDay() {
            return day;
        }

        public void setDay(int day) {
            this.day = day;
        }

        public String getEvent() {
            return event;
        }

        public void setEvent(String event) {
            this.event = event;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public int getMonth() {
            return month;
        }

        public void setMonth(int month) {
            this.month = month;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        @Override
        public String toString() {
            return "ResultBean{" +
                    "date='" + date + '\'' +
                    ", day=" + day +
                    ", event='" + event + '\'' +
                    ", id='" + id + '\'' +
                    ", month=" + month +
                    ", title='" + title + '\'' +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "HistoryTodayData{" +
                "msg='" + msg + '\'' +
                ", retCode='" + retCode + '\'' +
                ", result=" + result +
                '}';
    }
}
